package org.na.util;


import static com.sun.org.apache.bcel.internal.classfile.Utility.printArray;

public class StringTest {
    public void splitStr(){
        String str = "【方名】桃核承气汤。<br/>【别名】桃仁承气汤。<br/>【拼音】táo hé chéng qì tāng。<br/>【英文】Taohe Chengqi Decoction。<br/>【民族】汉方。<br/>【分类】理血剂。<br/>【归经】桃仁归心、肝、肺、大肠经，大黄归脾、胃、大肠、肝、心包经，桂枝归心、肺、膀胱经，甘草归心、肺、脾、胃经，芒硝归胃,大肠经。<br/>【来源】古代经典名方（第一批）。<br/>【名方】《伤寒论》。<br/>【组成】桃仁（去皮尖五十个）（12g）、大黄（12g）、桂枝（去皮）（6g）、甘草（炙）（12g）、芒硝（6g）。<br/>【君药】桃核、大黄。<br/>【臣药】桂枝、芒硝。<br/>【佐使药】炙甘草。<br/>【制方原理】<br/>证属瘀热互结下焦，治当因势利导，逐瘀泻热，以祛除下焦之蓄血。方中桃仁苦甘平，活血破瘀；大黄苦寒，下瘀泻热。二者合用，瘀热并治，共为君药。芒硝咸苦寒，泻热软坚，助大黄下瘀泻热；桂枝辛甘温，通行血脉，既助桃仁活血祛瘀，又防硝、黄寒凉凝血之弊，共为臣药。桂枝与硝、黄同用，相反相成，桂枝得硝、黄则温通而不助热；硝、黄得桂枝则寒下又不凉遏。炙甘草护胃安中，并缓诸药之峻烈，为佐使药。<br/>【用法】现代用法：作汤剂，水煎前4味，芒硝冲服。<br/>【功效】逐瘀泻热。<br/>【主治】下焦蓄血证。少腹急结，小便自利，神志如狂，甚则烦躁谵语，至夜发热；以及血瘀经闭，痛经，脉沉实而涩者。<br/>【方义】<br/>（1）方中桃仁苦甘平，活血破瘀。<br/>（2）大黄苦寒，下瘀泻热。<br/>（3）芒硝咸苦寒，泻热软坚，助大黄下瘀泻热。<br/>（4）桂枝辛甘温，通行血脉，既助桃仁活血祛瘀，又防硝、黄寒凉凝血之弊。<br/>（5）炙甘草护胃安中，并缓诸药之峻烈。<br/>【方论】<br/>柯琴《伤寒来苏集·伤寒附翼》卷下：“若太阳病不解，热结膀胱，乃太阳随经之阳热瘀于里，致气留不行，是气先病也。气者血之用，气行则血濡，气结则血蓄，气壅不濡，是血亦病矣。小腹者，膀胱所居也，外邻冲脉，内邻于肝。阳气结而不化，则阴血蓄而不行，故少腹急结；气血交并，则魂魄不藏，故其人如狂。治病必求其本，气留不行，故君大黄之走而不守者，以行其逆气；甘草之甘平者，以调和其正气；血结而不行，故用芒硝之咸以软之；桂枝之辛以散之；桃仁之苦以泄之。气行血濡，则小腹自舒，神气自安矣。此又承气之变剂也。此方治女子月事不调，先期作痛，与经闭不行者最佳。”<br/>【方剂衍化】<br/>（1）下瘀血汤：加䗪虫。<br/>（2）大黄䗪虫丸：加水蛭、虻虫及地黄、芍药、甘草等。<br/>（3）对妇人血瘀经闭、痛经以及恶露不下等症：常配合四物汤同用。<br/>（4）对跌打损伤：加赤芍、当归尾、红花、苏木、三七等以活血祛瘀止痛。<br/>（5）对火旺而血郁于上之吐血、衄血：加生地、丹皮、栀子等以清热凉血。<br/>【现代研究】<br/>（1）桃核承气汤对提高盆腔炎大鼠局部免疫力有一定的作用；对其受损的组织结构可起到修复作用；具有抑制血栓形成和血小板聚集的作用，大黄酸为桃核承气汤在体内产生活血化瘀的重要药效成分之一。<br/>（2）杨波等通过临床观察发现，用桃核承气汤化裁辅助西医治疗卵巢癌，其CA125半衰期的检测值小于40天者显著高于对照组，而化疗期间治疗组白细胞计数下降和恶心、呕吐程度较对照组明显减轻，差异均有统计学意义。认为桃核承气汤配合西药治疗晚期卵巢癌效果满意，比单纯手术加化疗效果好，副作用明显减少。<br/>（3）黄继荣认为，老年性便秘多虚，便秘又多用泻剂，屡伤气血，加之久病气血虚弱，又有宿食停滞，阻滞气血，必兼有瘀，血行不畅而加重便秘，故用桃核承气汤加减治疗老年顽固性便秘32例，结果全部治愈,随访半年均未复发。<br/>（4）江涛等认为用桃核承气汤活血通腑应做到早期、足量、中病即止，一般以3天内开始应用最佳，大黄、芒硝用量宜足，有利于腹胀、便秘、发热等症状的缓解，并对骨折原发病的恢复有重要的临床意义。其以桃核承气汤加减治疗胸腰椎骨折154例，总有效率96.75%。<br/>【临床应用】临床报道常用于治疗急性盆腔炎、胎盘滞留、附件炎、肠梗阻、前列腺增生、急性脑出血、血管性痴呆等属瘀热互结下焦者。<br/>【注意】表证未解者，当先解表，而后用本方。因本方为破血下瘀之剂，故孕妇禁用。<br/>【歌诀】桃核承气五般施，甘草硝黄并桂枝，淤热互结小腹胀，蓄血如狂最相宜。<br/>【古方组成】桃仁（去皮尖）（五十个）、大黄（四两）、桂枝（去皮）（二两）、甘草（炙）（二两）、芒硝（二两）。<br/>【古方用法】上五味，以水七升，煮取二升半，去滓，内芒硝，更上火，微沸下火，先食温服五合，日三服。<br/>【古方主治】《伤寒论》（汉•张仲景)“太阳病不解，热结膀胱，其人如狂，血自下，下者愈。其外不解者，尚未可攻，当先解其外；外解已，但少腹急结者，乃可攻之，宜桃核承气汤。”<br/>";
        String[] titles = str.split("】");
        for(String title : titles){
            int index = printArray(titles,title);
            System.out.println("第"+index+"段：/////////////"+title);
        }

    }

    private int printArray(String[] titles, String title) {
            for(int i = 0;i<titles.length;i++){
                if(titles[i]==title){
                    return i;
                }
            }
            return -1;//当if条件不成立时，默认返回一个负数值-1
    }

    public void main(String[] args){
        splitStr();
    }
}
